app/controllers/articles_controller.rb

SELECT `articles`.* FROM `articles` ORDER BY `articles`.`created_at` DESC
---
  def index
    @articles = Article.order(created_at: :desc)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 5 LIMIT 1
---
  def show
    @articles = Article.find(params[:id])

SELECT `series`.* FROM `series`
---
  def new
    @articles = Article.new
    @series = Series.all